{"text": "Title: Citi and BofA earnings, Johnson & Johnson, China blocks Boeing\nSummary: On today's Market Minute, Madison Mills recaps the trending stories on Wall Street in just 60 seconds. Citigroup (C) and Bank of America (BAC) stocks gain after reporting earnings that beat analyst estimates. Johnson & Johnson (JNJ) is in focus after reporting earnings results as US President Trump pushes for tariffs on pharmaceutical imports into the US. China reportedly stopped deliveries of Boeing (BA) orders as the US–China trade war continues, according to reporting from Bloomberg. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.\nURL: https://s.yimg.com/os/creatr-uploaded-images/2025-04/ed156490-1a0b-11f0-af17-4d1b05eaed56", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: BofA's Moynihan says 'we potentially face a changing economy' after stock traders post record haul\nSummary: Bank of America reported a first-quarter rise in profits and revenue driven by robust trading results, becoming the latest big bank to benefit from the market volatility surrounding President Trump’s tariff rollout.\nURL: https://s.yimg.com/os/creatr-uploaded-images/2024-04/90c8e320-fbde-11ee-beec-536b4cae8feb", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Big Bank earnings, Fed commentary, tax deadline: What to Watch\nSummary: Yahoo Finance host Josh Lipton highlights what to watch on Tuesday, April 15. Earnings reports are expected from Johnson & Johnson (JNJ), Albertsons (ACI), and United Airlines (UAL), as well as major banks like Bank of America (BAC) and Citi (C). Fresh Federal Reserve commentary is coming as Fed Governor Lisa Cook is set to speak. The deadline to file 2024 federal income tax returns is also on Tuesday. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime&nbsp;here.\nURL: https://s.yimg.com/os/creatr-uploaded-images/2025-04/a969b620-1979-11f0-85ff-bb1fb506a53c", "metadata": {"bank": "BAC", "date": "2025-04-14", "source": "news"}}
{"text": "Title: Stocks fizzle after two-day rally driven by bank earnings and tech\nSummary: Stocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nURL: https://media.zenfs.com/en/quartz.com/28e61168bcbbf305514780f7cc1342cb", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Stocks Halt Rally Amid Lingering Trade-War Risks: Markets Wrap\nSummary: (Bloomberg) -- Stocks whipsawed as President Donald Trump’s fast-evolving tariff war with top trade partners showed little signs of abating, leaving investors unwilling to take on too much risk after a two-day rally.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingThat’s even as results from Wall Street’s finan\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/918a6c76c2f7ec8e1cf6fb8a8d476aa0", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Stock Market Today: Dow Jones, S&P 500 Close Lower; But This Recent IPO Name Bolts Higher For 3rd Straight Day (Live Coverage)\nSummary: Stocks showed weakness Tuesday with the major indexes closing lower. But a recent IPO name climbed for a third straight day.\nURL: https://media.zenfs.com/en/ibd.com/082a456723a07faceed76599c00de18e", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Bank of America, Citi Stocks Rally; Wall Street Profits From Tariff Chaos\nSummary: Wall Street is raking in even more money from trading than it did during the market’s Covid-19 era swings.  Goldman Sachs, JPMorgan Chase and Morgan Stanley all said a surge in trading revenue helped lift their profits last quarter and beat expectations.\nURL: https://media.zenfs.com/en/wsj.com/7b2c285183be07ca3c4e8242b25a59a8", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Bank of America (BAC) Will Be ‘The Usual Fine Self’ – Jim Cramer Expects Steady Results\nSummary: We recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, […]\nURL: https://media.zenfs.com/en/insidermonkey.com/dc5a2bcb6b4c16a43cb5b4ba98feb139", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Merrill Lynch, BofA Private Bank Post Flat First-Quarter Profit While Assets, Clients Increase\nSummary: Merrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nURL: https://media.zenfs.com/en/Barrons.com/ef3d40cf5d31aa1ed77cefceacc3ecd3", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Big Banks Show Consumers Remained Resilient Heading Into Tariff Turmoil\nSummary: Bank of America and Citigroup said consumer spending ticked higher in the first quarter, when concerns about the economy began to bubble up.\nURL: https://media.zenfs.com/en/wsj.com/59d3d2beaba502493f9ec615121676a7", "metadata": {"bank": "BAC", "date": "2025-04-15", "source": "news"}}
