{"text": "Title: Is Acadian Asset Management Inc. (AAMI) Outperforming Other Finance Stocks This Year?\nSummary: Here is how Acadian Asset Management (AAMI) and BNP Paribas SA (BNPQY) have performed compared to their sector so far this year.\nURL: https://media.zenfs.com/en/zacks.com/f541c90e0d995722d10914cb76a7c653", "metadata": {"bank": "BNP", "date": "2025-04-15", "source": "news"}}
{"text": "Title: BNP Paribas Downgrades Projections for AXA IM Deal After Regulatory Guidance\nSummary: The lender expects a higher capital impact and lower return on investment than initially projected for its acquisition of AXA Investment Managers, after the ECB clarified its regulatory stance.\nURL: https://media.zenfs.com/en/wsj.com/7eed12da5a5e36f37bccec5cf9fe3e39", "metadata": {"bank": "BNP", "date": "2025-04-14", "source": "news"}}
{"text": "Title: European Stocks at One-Year Low as Trump Vows China Tariff Hike\nSummary: (Bloomberg) -- European stocks plunged to the lowest in more than a year on Monday, as President Donald Trump issued a fresh tariff threat to China and foreign leaders raced to the negotiating table to persuade him to lower his steep tariff charges. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsBoston Mayor Wu Embraces Trump Resistance as Cam\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/d7dcb7f676e14098b3d124770f0f16ab", "metadata": {"bank": "BNP", "date": "2025-04-07", "source": "news"}}
{"text": "Title: Copper’s Bull Run Turns to Rout as Reality of Tariffs Bites\nSummary: (Bloomberg) -- Two weeks ago, copper prices were surging as traders warned that threatened US tariffs on the metal would squeeze global supplies. Now, bulls are confronting one of the market’s worst-ever selloffs as President Donald Trump’s broader trade war upends the outlook for demand.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Ho\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/a8941ce7b5b4c2aa9f9347a03f463c13", "metadata": {"bank": "BNP", "date": "2025-04-07", "source": "news"}}
{"text": "Title: European Stocks Sink by Most Since August on Tariff Shock\nSummary: (Bloomberg) -- European stocks suffered their worst day in eight months after US President Donald Trump announced the steepest tariffs in a century, including a 20% rate for the European Union.Most Read from BloombergMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLondon Clears Final Hurdle for More High-Speed Trains to EuropeLocal Governments Vie for Fired Federal WorkersHousing Agency Aims to Relocate Its DC HeadquartersWhat Would ‘Transportation Abundance’ Look Lik\nURL: https://s.yimg.com/os/creatr-uploaded-images/2025-04/b37cb080-1065-11f0-87ff-1a503b44be86", "metadata": {"bank": "BNP", "date": "2025-04-03", "source": "news"}}
{"text": "Title: China Vows Retaliation as Trump Unleashes ‘Bazooka’ US Tariffs\nSummary: (Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLondon Clears Final Hurdle for More High-Speed Trains to EuropeLocal Governments Vie for Fired Federal WorkersChicago School District Agrees to Minimum 16% Teacher Pay RaiseChina vowed to retaliate against Donald Trump’s biggest tariffs yet, putting the world’s largest economies on a collision course that risk\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/1456bc7cc8c0fae404718d87400161f0", "metadata": {"bank": "BNP", "date": "2025-04-03", "source": "news"}}
{"text": "Title: Best Momentum Stocks to Buy for April 3rd\nSummary: VEEV, BNPQY and NECB made it to the Zacks Rank #1 (Strong Buy) momentum stocks list on April 3, 2025.\nURL: https://media.zenfs.com/en/zacks.com/5167b486bdd0f986aff26dac3fff825f", "metadata": {"bank": "BNP", "date": "2025-04-03", "source": "news"}}
{"text": "Title: BNP slides as media reports Belgium considers selling stake\nSummary: Traders attributed BNP's sharper selloff to the report of the possible Belgian sale.  Through its financial arm, SFPIM, Belgium currently holds a 5.6% stake in the French lender, following the group's acquisition of Fortis Bank Belgium in 2009.  Belgium is looking for options to fund its planned increase in defence spending, in order to reach 2% of its gross domestic product this year, the minimum level agreed among NATO allies.\nURL: https://media.zenfs.com/en/reuters-finance.com/4af9ae32ef3d613d4defd817cf3d7b94", "metadata": {"bank": "BNP", "date": "2025-04-02", "source": "news"}}
{"text": "Title: Oil Dips as Traders Assess Impact of Ceasefire on Russian Flows\nSummary: (Bloomberg) -- Oil dipped, halting the longest rally in almost three months, after Ukrainian President Volodymyr Zelenskiy agreed to implement a partial truce, raising expectations that Russian crude will soon flow freely. Most Read from BloombergThey Built a Secret Apartment in a Mall. Now the Mall Is Dying.Why Did the Government Declare War on My Adorable Tiny Truck?Trump Slashed International Aid. Geneva Is Feeling the Impact.Chicago Transit Faces ‘Doomsday Scenario,’ Regional Agency SaysHow\nURL: https://media.zenfs.com/en/bloomberg_markets_842/99e59a02d8d3462b08350d6ae0260625", "metadata": {"bank": "BNP", "date": "2025-03-25", "source": "news"}}
{"text": "Title: U.S. Tariffs Likely to Hit EU Growth More Than Inflation\nSummary: U.S. tariffs are likely to impact growth faster than inflation and the European Central Bank will keep cutting interest rates as a result, at least in the short term, BNP Paribas Markets 360's Paul Hollingsworth said in a webinar.  \"The negative impact on growth stemming from tariffs and the uncertainty related [to them] is probably going to come quicker than the boost you are getting to the medium-term growth prospects from higher fiscal spending,\" the head of developed markets economics said.  BNP Paribas Markets 360 expects ECB rate cuts in April and June.\nURL: https://media.zenfs.com/en/Barrons.com/12ea0f43d8f8307249a68d1cb2e0587e", "metadata": {"bank": "BNP", "date": "2025-03-18", "source": "news"}}
