{"text": "Title: Citi and BofA earnings, Johnson & Johnson, China blocks Boeing\nSummary: On today's Market Minute, Madison Mills recaps the trending stories on Wall Street in just 60 seconds. Citigroup (C) and Bank of America (BAC) stocks gain after reporting earnings that beat analyst estimates. Johnson & Johnson (JNJ) is in focus after reporting earnings results as US President Trump pushes for tariffs on pharmaceutical imports into the US. China reportedly stopped deliveries of Boeing (BA) orders as the US–China trade war continues, according to reporting from Bloomberg. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.\nURL: https://s.yimg.com/os/creatr-uploaded-images/2025-04/ed156490-1a0b-11f0-af17-4d1b05eaed56", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: BofA's Moynihan says 'we potentially face a changing economy' after stock traders post record haul\nSummary: Bank of America reported a first-quarter rise in profits and revenue driven by robust trading results, becoming the latest big bank to benefit from the market volatility surrounding President Trump’s tariff rollout.\nURL: https://s.yimg.com/os/creatr-uploaded-images/2024-04/90c8e320-fbde-11ee-beec-536b4cae8feb", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Big Bank earnings, Fed commentary, tax deadline: What to Watch\nSummary: Yahoo Finance host Josh Lipton highlights what to watch on Tuesday, April 15. Earnings reports are expected from Johnson & Johnson (JNJ), Albertsons (ACI), and United Airlines (UAL), as well as major banks like Bank of America (BAC) and Citi (C). Fresh Federal Reserve commentary is coming as Fed Governor Lisa Cook is set to speak. The deadline to file 2024 federal income tax returns is also on Tuesday. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime&nbsp;here.\nURL: https://s.yimg.com/os/creatr-uploaded-images/2025-04/a969b620-1979-11f0-85ff-bb1fb506a53c", "metadata": {"bank": "Citi", "date": "2025-04-14", "source": "news"}}
{"text": "Title: Goldman, Wells Fargo Lead $17 Billion Bank Borrowing Spree\nSummary: (Bloomberg) -- Goldman Sachs Group Inc. and Wells Fargo & Co. sold a combined $14 billion of US investment-grade bonds Tuesday, matching the day-earlier total from peers Morgan Stanley and JPMorgan Chase & Co.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingWells Fargo is issuing $8 billion of bonds in four par\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/861b936068ea0cdc299f2db5c7386a25", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Stocks fizzle after two-day rally driven by bank earnings and tech\nSummary: Stocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nURL: https://media.zenfs.com/en/quartz.com/28e61168bcbbf305514780f7cc1342cb", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Bank of America, Citi Stocks Rally; Wall Street Profits From Tariff Chaos\nSummary: Wall Street is raking in even more money from trading than it did during the market’s Covid-19 era swings.  Goldman Sachs, JPMorgan Chase and Morgan Stanley all said a surge in trading revenue helped lift their profits last quarter and beat expectations.\nURL: https://media.zenfs.com/en/wsj.com/7b2c285183be07ca3c4e8242b25a59a8", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Citigroup (C) Has Gotten So Loved, It’ll Roar No Matter What – Jim Cramer Applauds Jane Fraser\nSummary: We recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Citigroup Inc. (NYSE:C) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nURL: https://media.zenfs.com/en/insidermonkey.com/dc5a2bcb6b4c16a43cb5b4ba98feb139", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Citi wealth says 'strategy is working' as net new assets surge\nSummary: Citi's wealth division saw a nearly five-fold increase in new investment assets in the first quarter. CEO Jane Fraser said the firm has \"real horsepower and firepower in our investment capabilities.\"\nURL: https://media.zenfs.com/en/financial_planning_664/19aabb01f4102d9c5cbe5a515c051e42", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Citigroup (NYSE:C) Sees Q1 2025 Earnings Growth With Net Income Rising To US$4 Billion\nSummary: Citigroup (NYSE:C) recently reported strong first-quarter earnings, with net income and net interest income both showing marked year-over-year growth. The company's share price reflected this positive performance, rising 7% over the past week. This increase coincided with the broader uplift in the market, which rose 7% as banks and tech stocks led indices higher. While Citigroup's earnings report likely supported the stock's rise, the company also benefited from market trends, with a general...\nURL: https://media.zenfs.com/en/simply_wall_st__316/3eeb773aae18c65577be7c961694f7c0", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Big Banks Show Consumers Remained Resilient Heading Into Tariff Turmoil\nSummary: Bank of America and Citigroup said consumer spending ticked higher in the first quarter, when concerns about the economy began to bubble up.\nURL: https://media.zenfs.com/en/wsj.com/59d3d2beaba502493f9ec615121676a7", "metadata": {"bank": "Citi", "date": "2025-04-15", "source": "news"}}
