{"text": "Title: BofA's Moynihan says 'we potentially face a changing economy' after stock traders post record haul\nSummary: Bank of America reported a first-quarter rise in profits and revenue driven by robust trading results, becoming the latest big bank to benefit from the market volatility surrounding President Trump’s tariff rollout.\nURL: https://s.yimg.com/os/creatr-uploaded-images/2024-04/90c8e320-fbde-11ee-beec-536b4cae8feb", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Goldman, Wells Fargo Lead $17 Billion Bank Borrowing Spree\nSummary: (Bloomberg) -- Goldman Sachs Group Inc. and Wells Fargo & Co. sold a combined $14 billion of US investment-grade bonds Tuesday, matching the day-earlier total from peers Morgan Stanley and JPMorgan Chase & Co.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingWells Fargo is issuing $8 billion of bonds in four par\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/861b936068ea0cdc299f2db5c7386a25", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Trump Ally Marjorie Taylor Greene Bought Tesla, Amazon, Blackstone Before Rally\nSummary: (Bloomberg) -- Representative Marjorie Taylor Greene sold US Treasuries and bought stakes in Amazon.com Inc., Blackstone Inc. and Tesla Inc. the day before President Donald Trump put a 90-day pause on retaliatory tariffs and prompted a market rally.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingGreene, the Ge\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/908b4b1588fd30bd274c2a6098c7c8a3", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Where Trump Tariffs Stand Now\nSummary: Here's what is still in effect after this week's 90-day pause on \"reciprocal\" tariffs.\nURL: https://media.zenfs.com/en/ibd.com/02b72a4b3ae49f9f88527787e6042c7d", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Trump Tariffs: Here's What JPMorgan Investors Need to Know\nSummary: Despite recent stock market volatility, JPMorgan Chase (NYSE: JPM) shares are down just 1% year to date, outperforming the 9% decline in the S&P 500 (SNPINDEX: ^GSPC) at the time of writing.  The banking giant continues to benefit from its fortress-like balance sheet and global diversification, making it well-positioned to navigate any economic environment.  JPMorgan topped Wall Street estimates, with revenue climbing 8% year over year, while earnings per share (EPS) of $5.07 was up 14% from the prior-year quarter.\nURL: https://media.zenfs.com/en/motleyfool.com/fc3dd06f39cf341fae2c9b28d67ba219", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Is JPMorgan Chase (JPM) Among The Top Goldman Sachs Value Stocks?\nSummary: We recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading […]\nURL: https://media.zenfs.com/en/insidermonkey.com/f82652d0e7c350dea8b9d7c85e94e30e", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: JPMorgan Chase & Co. (JPM) Is a Trending Stock: Facts to Know Before Betting on It\nSummary: JPMorgan Chase & Co. (JPM) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.\nURL: https://media.zenfs.com/en/zacks.com/023168c7ea091c342492be3899b280af", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Wall Street banks reap $37bn from Trump trading boom\nSummary: Wall Street’s biggest banks reaped almost $37bn in trading revenues in the first quarter of the year — their best performance in more than a...\nURL: https://s.yimg.com/os/creatr-uploaded-images/2025-04/7ae80920-19fe-11f0-b6ff-8c83e3168014", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Bank Trading Desks Are Minting Money From Trump’s Tariff Chaos\nSummary: Goldman Sachs JPMorgan Chase  and  Morgan Stanley  all said a surge in trading revenue helped lift their profits in the first quarter and beat expectations.  Bank trading desks have been collecting more fees from investors scrambling to reduce or dial up the risk in their portfolios on any new clue about how  President Trump’s  tariffs might ultimately play out.  Combined, the three banks earned more than $12 billion in fees in their equities businesses, the desks that run stock-market related activities for clients.\nURL: https://media.zenfs.com/en/wsj.com/112ab0b5ec361666997408a6aafc513a", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
{"text": "Title: Bond Rebound Relieves Markets Dazed by Week of Trade Turmoil\nSummary: (Bloomberg) -- Wall Street on Monday finally caught a respite from the deep selloffs and unusually sharp swings that have raced through markets ever since President Donald Trump unleashed his global trade war. Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing Shortage$15 Million Fund Bets Leadership Training Can Improve Chicago P\nURL: https://media.zenfs.com/en/bloomberg_holding_pen_162/dad5d5cda117fd8d1faa564ad024eccb", "metadata": {"bank": "JPM", "date": "2025-04-15", "source": "news"}}
